name = input("what is your name?:")

surname = input("what is your surname?:")

print("გამარჯობა! მოგესალმებათ GOA ბანკი" + " " + name + " " + surname)

print("ქვემოთ მოცემული ვარიანტებიდან რომლის არჩვა გსურთ?")

print(" ")

print("1)ბარათზე თანხის შეტანა") 

print(" ")

print("2)ბარათიდან თანხის გამოტანა")

print(" ")

print("3)მობილურზე თანხის შეტანა")

print(" ")

print("4)სესხის დაფარვა")    

print(" ")

print("5)სესხის აღება")

print(" ")

print("6)კომუნალურები")

print(" ")




archevani = input("რომლის არჩევა გსურთ?  არჩევანი დააფიქსირეთ ნომრით:")

if archevani == "1":
    print("თვენი არჩევანი არის ბარათზე თანხის შეტანა ")
    print("რომელი ბარათს შევსება გსურთ?:")
    print("1)საქართლოს ბანკი")
    print("2)თიბისი ბანკი")
    print("3)გოა ბანკი")
    banki = input("რომელი ბარათის შევსება გსურთ?:")
    print(" ")
    if banki == "1":
        print("თქვენ აირჩეთ საქართველის ბანკი")
        print("როგორ გსურთ ბარათის შევსება")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati = input("რომლის არჩვა გსურთ?:")
        if barati == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif banki == "2":
        print("თქვენ აირჩეთ თიბისი ბანკი")
        print("როგორ გსურთ ბარათის შევსება")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati = input("რომლის არჩვა გსურთ?:")
        if barati == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif banki == "3":
        print("თქვენ აირჩეთ გოა ბანკი")
        print("როგორ გსურთ ბარათის შევსება")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati = input("რომლის არჩვა გსურთ?:")
        if barati == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    

elif archevani == "2":
    print("თვენი არჩევანი არის ბარათიდან თნხის გამოტანა")
    print("რომელი ბარათიდან გსურთ თანხის გამოტანა:")
    print("1)საქართლოს ბანკი")
    print("2)თიბისი ბანკი")
    print("3)გოა ბანკი")
    banki = input("რომელი ბარათიდან გსურთ თნხის გამოტანა?:")
    if banki == "1":
        print("თქვენ აირჩეთ საქართველის ბანკი")
        print("როგორ გსურთ ბარათიდან თანხის გამოტანა?")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati3 = input("რომლის არჩვა გსურთ?:")
        if barati3 == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათიდან თნხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიშიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარიი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati3 == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათიდან თანხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიშიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati3 == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათიდან თნხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif banki == "2":
        print("თქვენ აირჩეთ თიბისი ბანკი")
        print("როგორ გსურთ ბარათიდან თანხის გამოტანა?")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati3 = input("რომლის არჩვა გსურთ?:")
        if barati3 == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათიდან თნხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიშიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარიი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati3 == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათიდან თანხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიშიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati3 == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათიდან თნხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif banki == "3":
        print("თქვენ აირჩეთ გოა ბანკი")
        print("როგორ გსურთ ბარათიდან თანხის გამოტანა?")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati3 = input("რომლის არჩვა გსურთ?:")
        if barati3 == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათიდან თნხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიშიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარიი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati3 == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათიდან თანხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიშიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati3 == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათიდან თნხის გამოტანა")
            tanxa6 = input("რა თანხის გამოტანა გსურთ?:")
            print("თქვენ ანგარიდან ჩმოგეჭრათ" + " " + tanxa6 + " " + "ლარი")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
       
        
elif archevani == "3":
    print("მობილურზე თანხის შეტანა")
    print("რომელ ქსელზე გსურთ თანხის შტანა?:")
    print("1)მაგთი")
    print("2)ბილაინი")
    print("3)ჯეოსელი")
    qseli = input("რომლის არჩვა გსურთ?:")
    if qseli == "1":
        print("თქვენ აირჩეთ მაგთი")
        tanxa3 = input("რა რაოდენობის თანხის შეტანა გსურთ?:")
        print("თქვენი ბალანსი შივსო" + " " + tanxa3 + " " + "ლარით")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif qseli == "2":
        print("თქვენ აირჩეთ ბილაინი")
        tanxa3 = input("რა რაოდენობის თანხის შეტანა გსურთ?:")
        print("თვენი ბალანსი შეივსო" + " " + tanxa3 + " " + "ლარით")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif qseli == "3":
        print("თქვენ აირჩეთ ჯეოსელი")
        tanxa3 = input("რა რაოდენობის თანხის შეტანა გსურთ?:")
        print("თქვენი ბალანსი შეივსო" + " " + tanxa3 + " " + "ლარით")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

elif archevani == "4":
    print("სესხის დაფარვა")
    print("თქვენს სახელზეა 3 სესხი")
    print("რა სახის სესხის დაფარვა გსურთ?:")
    print("1)სამომხმარებლო სესხი")
    print("2)ავტო სესხი")
    print("3)სტუდენტური სესხი")
    sesxi = input("რომლის არჩვა გსურთ?:")
    if sesxi == "1":
        print("თქვენ აირჩეთ სამომხმარებლო სესხი")
        tanxa4 = input("რა რაოდენობით გსურთ სესხის დაფარვა? სულ გადასახდელია:2540:")
        print("თქვენ სესხი დაფარეთ" + " " + tanxa4 + " " + "ლარით")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif sesxi == "2":
        print("თქვენ აირჩეთ ავტო სესხი")
        tanxa4 = input("რა რაოდენობით გსურთ სესხის დაფარვა?: სულ გადასახდელია 1500:")
        print("თვენ სესხი დაფარეთ" + " " + tanxa4 + " " + "ლარით")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif sesxi == "3":
        print("თქვენ აირჩეთ სტუდენტური სესხი")
        tanxa4 = input("რა რაოდენობით გსურთ სესხის დაფარვა? სულ გადასახდელია 970:")
        print("თქვენ სესხი დაფარეთ" + " " + tanxa4 + " " + "ლარით")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")


elif archevani == "5":
    print("სესხის აღება")
    print("თქვენს სახელზეა 3 სესხი")
    print("რა სახის სესხის აღება გსურთ?:")
    print("1)სამომხმარებლო სესხი")
    print("2)ავტო სესხი")
    print("3)სტუდენტური სესხი")
    sesxi2 = input("რომლის არჩვა გსურთ?:")
    if sesxi2 == "1":
        print("თქვენ აირჩეთ სამომხმარებლო სესხი")
        tanxa5 = input("რა რაოდენობის სესხის აღება გსურთ? სულ ხელმისაწვდომია:2250:")
        print("თქვენ დაგერიცხათ" + " " + tanxa5 + " " + "ლარი")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif sesxi2 == "2":
        print("თქვენ აირჩეთ ავტო სესხი")
        tanxa5 = input("რა რაოდენობის სესხის აღბა გსურთ?: სულ ხელმისაწვდომია 1400:")
        print("თვენ დაგერიცხათ" + " " + tanxa5 + " " + "ლარი")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif sesxi2 == "3":
        print("თქვენ აირჩეთ სტუდენტური სესხი")
        tanxa5 = input("რა რაოდენობის სესხის აღება გსურთ? სულ ხელმისაწვდომია 3470:")
        print("თქვენ დაგერიცხათ" + " " + tanxa5 + " " + "ლარი")
        print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

    
    

elif archevani == "6":
    print("კომუნალურები")
    print("1)გაზი")
    print("2)წყალი")
    print("3)ელექტრო ენერგია")
    print("4)ინტერნეტი")
    komunalurebi = input("რომელი კომუნალკურის გადახდა გსურთ?")
    if komunalurebi == "1":
        print("თქვენ აირჩიეთ გაზი")
        gazi = input("გსურთ რომ ახლა გადაიხადოთ გაზი? გადასახდელია 20.50თ")
        if gazi == "კი":
            print("თქვენ ბარათდან ჩამოგეჭრათ 20.50ლ")
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif gazi == "არა":
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif komunalurebi == "2":
        wyali = input("გსურთ რომ ახლა გადაიხადოთ წყალი? გადასახდელია - 54ლ") 
        if wyali == "კი":
            print("თვენ ბარათიდან ჩმოგეჭრათ 54ლ")
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif wyali == "არა":
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif komunalurebi == "3":
        eleqtro_energia = input("გსურთ რომ ახლა გადაიხადოთ ელექტრო ენერგია? გადასახდელია 112.50ლ")
        if eleqtro_energia == "კი":
            print("თქვენ ბარათიდან ჩამოგეჭრათ 112.5ლ")
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                 print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif eleqtro_energia == "არა":
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif komunalurebi == "4":
        interneti = input("გსურთ რომ ახლა გადაიხადოთ ელექტრო ენერგია? გადასახდელია 46.60ლ")
        if interneti == "კი":
            print("თვენი ბარათდან ჩამოგეჭრათ 46.60ლ") 
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif interneti == "არა":
             print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

    




    











