name = input("what is your name?:")

surname = input("what is your surname?:")

print("გამარჯობა! მოგესალმებათ GOA ბანკი" + " " + name + " " + surname)

print("ქვემოთ მოცემული ვარიანტებიდან რომლის არჩვა გსურთ?")

print(" ")

print("1)ბარათზე თანხის შეტანა") 

print(" ")

print("2)ბარათიდან თანხის გამოტანა")

print(" ")

print("3)მობილურზე თანხის შეტანა")

print(" ")

print("4)სესხის დაფარვა")    

print(" ")

print("5)სესხის აღება")

print(" ")

print("6)კომუნალურები")

print(" ")




archevani = input("რომლის არჩევა გსურთ?  არჩევანი დააფიქსირეთ ნომრით:")

if archevani == "1":
    print("თვენი არჩევანი არის ბარათზე თანხის შეტანა ")
    print("რომელი ბარათს შევსება გსურთ?:")
    print("1)საქართლოს ბანკი")
    print("2)თიბისი ბანკი")
    print("3)გოა ბანკი")
    banki = input("რომელი ბარათის შევსება გსურთ?:")
    print(" ")
    if banki == "1":
        print("თქვენ აირჩეთ საქართველის ბანკი")
        print("როგორ გსურთ ბარათის შევსება")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati = input("რომლის არჩვა გსურთ?:")
        if barati == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif banki == "2":
        print("თქვენ აირჩეთ თიბისი ბანკი")
        print("როგორ გსურთ ბარათის შევსება")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati = input("რომლის არჩვა გსურთ?:")
        if barati == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif banki == "3":
        print("თქვენ აირჩეთ გოა ბანკი")
        print("როგორ გსურთ ბარათის შევსება")
        print("1)ანგარიშის ნომერი")
        print("2)პირადი ნომრით")
        print("3)მობილური ნომრით")
        barati = input("რომლის არჩვა გსურთ?:")
        if barati == "1":
            print("თქვენ აირჩეთ ანგარიშის ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "2":
            print("თქვენ აირჩეთ პირადი ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif barati == "3":
            print("თქვენ აირჩეთ მობილური ნომრით ბარათის შევსება")
            tanxa = input("რა თანხის შეტანა გსურთ?:")
            print("თქვენი ანგარიში შეივსო" + " " + tanxa + " " + "ლარით")
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    

elif archevani == "2":
    print("თვენი არჩევანი არის ბარათიდან თნხის გამოტანა")
    print("რომელი ბარათიდან გსურთ თანხის გამოტანა:")
    print("1)საქართლოს ბანკი")
    print("2)თიბისი ბანკი")
    print("3)გოა ბანკი")
    banki = input("რომელი ბარათიდან გსურთ თნხის გამოტანა?:")
    if banki == "1":
        print("თქვენ აირჩეთ საქართველის ბანკი")
        print("როგორ გსურთ თანხის გამოტანა") ###############აქედან ვაგრძლებთ

        
   

#ფრგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგგ
elif archevani == "3":
    print("მობილურზე თანხის შეტანა")
    mobilurze_shetanili_tanxa = input("რა ოდენობის თნხის შეტანა გსურთ?")
    print("თვენი ანგარიში შეივსო" + " " +  mobilurze_shetanili_tanxa)
    print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

elif archevani == "4":
    print("სესხის დაფარვა")
    shetanili_tanxa = input("რა ოდენობის თნხით გსურთ დაფაროთ სესხი?")
    print("თვენი სესხი დაიფარა" + " " + shetanili_tanxa)
    print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

elif archevani == "5":
    print("სესხის აღება")
    agebuli_tanxa = input("რა ოდენობის თნხის აღბა გსურთ?")
    print("თქვენ მიიღეთ" + " " + agebuli_tanxa)
    print("გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

elif archevani == "6":
    print("კომუნალურები")
    print("1)გაზი")
    print("2)წყალი")
    print("3)ელექტრო ენერგია")
    print("4)ინტერნეტი")
    komunalurebi = input("რომელი კომუნალკურის გადახდა გსურთ?")
    if komunalurebi == "1":
        print("თქვენ აირჩიეთ გაზი")
        gazi = input("გსურთ რომ ახლა გადაიხადოთ გაზი? გადასახდელია 20.50თ")
        if gazi == "კი":
            print("თქვენ ბარათდან ჩამოგეჭრათ 20.50ლ")
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif gazi == "არა":
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif komunalurebi == "2":
        wyali = input("გსურთ რომ ახლა გადაიხადოთ წყალი? გადასახდელია - 54ლ") 
        if wyali == "კი":
            print("თვენ ბარათიდან ჩმოგეჭრათ 54ლ")
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif wyali == "არა":
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif komunalurebi == "3":
        eleqtro_energia = input("გსურთ რომ ახლა გადაიხადოთ ელექტრო ენერგია? გადასახდელია 112.50ლ")
        if eleqtro_energia == "კი":
            print("თქვენ ბარათიდან ჩამოგეჭრათ 112.5ლ")
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                 print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif eleqtro_energia == "არა":
            print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
    elif komunalurebi == "4":
        interneti = input("გსურთ რომ ახლა გადაიხადოთ ელექტრო ენერგია? გადასახდელია 46.60ლ")
        if interneti == "კი":
            print("თვენი ბარათდან ჩამოგეჭრათ 46.60ლ") 
            qvitari = input("გნებავთ ქვითრი?")
            if qvitari == "კი":
                print("ინებეთ ქვითარი")
            elif qvitari == "არა":
                print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")
        elif interneti == "არა":
             print("ოპერაცია დასრულებულია,გმადლობთ რომ სარგებლობთ GOA-ს ბანკომატით")

    




    


   



#ღილაკი რომელიც აარჩვინებს ფუნქციას






